Tekla.Structures.Drawing.SectionMark
The SectionMark class defines a drawing object that illustrates a straight section in a specific view.
The following code inserts a new section mark in the current drawing:
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class SectionMarkExample
{
public void SectionMarkInsert()
{
DrawingHandler myDrawingHandler = new DrawingHandler();
DrawingObjectEnumerator viewsEnumerator = myDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews();
View view = null;
if (viewsEnumerator.MoveNext())
view = viewsEnumerator.Current as View;
if (view != null)
{
SectionMark sectionMark = new SectionMark(view, new Point(1000, 2000), new Point(3000, 1200));
sectionMark.Insert();
}
}
}

Tekla.Structures.Drawing.SectionMark.#ctor(Tekla.Structures.Drawing.View,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Creates a new section mark instance with the given positions.
view: The view to be used.
leftPoint: The starting point of the left side of the new section mark.
rightPoint: The starting point of the right side of the new section mark.

Tekla.Structures.Drawing.SectionMark.#ctor(Tekla.Structures.Drawing.View,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.SectionMarkBase.SectionMarkAttributes)
Creates a new section mark instance with the given positions and attributes.
view: The view to be used.
leftPoint: The starting point of the left side of the new section mark.
rightPoint: The starting point of the right side of the new section mark.
sectionMarkAttributes: The section mark attributes to be used.